# -*- coding: utf-8 -*-

# Define here the models for your scraped items
#
# See documentation in:
# https://doc.scrapy.org/en/latest/topics/items.html
from Crypto.Cipher import AES #pycrypto
import scrapy,time,re,json,sqlite3,hashlib,datetime,redis,pymysql,requests


#把列表内int 型转换 str
def zidianformdata(items):
    aaa=eval(str(items))
    for x in aaa:
        if aaa[x]==None:
            aaa[x]=''
        else:
            aaa[x]=str(aaa[x])
            #处理过滤
            aaa[x]=re.sub(r'<video(.+?)/video>','',aaa[x])
            aaa[x]=re.sub(r'<audio(.+?)/audio>','',aaa[x])
    return aaa

#设置爬取的天数
def time88(timeStamp):
    try:
        if '年' in str(timeStamp):
            timeStamp=int(time.mktime(time.strptime(str(timeStamp)[:10], "%Y年%m月%d")))
        if '-' in str(timeStamp):
            timeStamp=int(time.mktime(time.strptime(str(timeStamp)[:10], "%Y-%m-%d")))
        elif '/' in str(timeStamp):
            timeStamp=int(time.mktime(time.strptime(str(timeStamp)[:10], "%Y/%m/%d")))
        elif '.' in str(timeStamp):
            timeStamp=int(time.mktime(time.strptime(str(timeStamp)[:10], "%Y.%m.%d")))
        else:
            timeStamp=str(timeStamp)[:10]
        paqushijian=3     #设置爬取天数
        return (time.time()-(paqushijian*86400))<int(timeStamp)
    except:
        return False

#这个是之前用来过滤标题的，目前已经不用
def guolu(title):
    # try:
    #   ci=['成品','水泵','一体机','驾驶员','监测执法','遥感','塑胶跑道','编辑','出版','石漠化','水井检修','假肢','辅具','读数','大讲堂','文化演出','视频监控','燃煤锅炉','燃气锅炉','锅炉','表决','手术','麻醉','捕犬','设备改造','中央空调','医用','健身器材','继续教育','成品面','校企合作','教育','森林','抚育','补贴','车辆维修','电子商务','出让','收益评估','垃圾','冷库','防治','虫病','充电站','水果','种植','白蚁治理','四电集成','通信专业','火化炉','动态管理','跟踪评价','遮阳','白蛾','居家','立面整治','造林','管理培训','虾稻','蔬菜','鱼池','渔政','船舶维修','船维修','安全保卫','宣传','汽车维修','燃气','森林资源','饮水安全','管材','校车','耕地','应急调查','肥料','切纸机','电脑','办公用品','办公设备','复印机','打印机','碎纸机','扫描仪','投影仪','文具','纸张','食堂','课件','纳滤膜','特许经营','养鸡','生活垃圾','变压器','灯具','打药机','采暖炉','施药','院墙','被装','学生桌','生产线','拍卖','乙酸钠','溶液','报警器','消毒粉','蒸压','复合肥','数字照相机','笔记本','防尘网','办公空调','应急','救援','水晶UV板','装订机','电锅炉','街道护栏','摄像','摄影','垃圾中转','公交车辆','柜式空调','高空作业','指示灯','不锈钢','洗衣机','热水器','摄像机','泡沫','灭火剂','飞行','表演','安保','有机肥料','防护装备','军训','桌面','柜子','生活用品','公务车','终端','动物','疫苗','教学仪器','训练','器材','入户核查','文化戏曲','艺术活动','窗帘帷幔','开水炉','午餐','高频','电刀','统种','小麦','良种','垃圾桶','社工','岗位','设备耗材','编印','遥感仪','综合制景','用药','电池','政银','禁毒','宣介','在线交易','成像系统','工作网','船只拆解','激光打印机','针式打印机','证书','外壳','分析与对策','外网建设','影像图','耕地质量','动态血压','承办','安全柜','量具','电位仪','清淤','提升班','预算编审','冰箱','提升方案','检测设备','还林','强电','警服','移植','抢险车','带吊车','门牌','燃油','汽油','柴油','法律咨询','会计','审计','抽样检测','作业本','营销单位','互联互通','外宣品','查房','追溯','保安员','雕塑','蓄电池','牌制作','仪器','报警系统','自来水改造','水质监测','机械改造','温室大棚','播出系统','演练','聘请','絮凝剂','亮化','应急队','节能改造','课桌凳','弃地复垦','多媒体','微机室','光缆','粉煤灰','配件','新能源汽车','包装纸','光谱仪','电子卖场','灭火器','信息采集','物业','保安','菇棚','绿植','改厕','整理','数据整合','影音设备','水质提升','压缩机','草花','辅导','彩票','食材','墓料','防雷检测','垃圾清运','白蚁','农资','农业技术','鲜花栽种','执法拖车','伐木','电脑终端','酸洗','监护仪','农药','应急通信','风沙治理','警用','摩托车','许可管理','垃圾处理','自助','制服','管养','刑事技术装备','副食配送','孵化园','通用设备','无障碍','门禁','绿化宣传','远程医疗','防漏','硒鼓','饮水机','通风笼','瓷砖','妇联','警务通','印刷品','期刊','信息发布','土地储备','情况测算','零星养护','设施维修','网约车','应急处置','网架','照明','发电机','趸船','演出','治疗仪','终端设备','执法设备','厨房设备','交通巡逻','消毒','灭菌器','流通商品','旅游','推介','平台升级','军事训练','食品抽检','文员管理','组织策划','代理记账','热水系统','档案整理','非遗','土壤','水稻种子','记账','不动产','证件防伪','报警装置','常压锅炉','冷库设备','照手挑','数据清理','虫病防治','停车道闸','坩埚','平板电脑','冷却塔','无人机','打包','转子','紧固件','棉油生产','酒店经营','蜂蜜','燃料','路径识别','CPC卡','抓拍系统','小微贷','系统单','储量评审','税务','实训设备','商铺促销','实验设备','工作台','升箱机','碳钢','管件','软硬件','维保','餐厨','房屋维修','燃气安装','电视机','网上超市','产业孵化','人事考试','防雷及接地','深林抚育','辅助工具','砷锑超标','社会化','包装物回收','干式胶片','实训室设备','送货','中介','清扫车','公众教育','交换机','备件','接触线','物资打包','车辆备件','碳排放','教具器材','架空线路','硝酸铵','路演','栽植','航拍','气氛','显示屏','脑电图','林地恢复','树苗','认价','竹竿','化肥','微信','微博','加油','血样','监测站','打印','大气监测','骨灰盒','电梯维保','布展','磁盘阵列','人工草皮','高清视频','会议系统','托管','情况测评','分类果壳箱','窗帘','零库存','应急改造','文体公益','天然气安装','咨询室调度系统','应急体系','农业开发','追肥','辅助排查','除臭','收容','成效','考核','专管员','垃圾车','体育活动','电影设备','电视','春值','节气改造','风机盘管','电流实验','拆旧复垦','种子','三供一业','避险解困','机械维保','迎检资料','印刷','公务用车','低值','易耗品','防雷装置','苗木移栽','除险加固','森林抚育','3D展示','清雪','塑胶操场','市场促销','遗体','流失','积水治理','花椒','抢救','鸡种','鸡场','成品油','UPS电源','气象监测','牡丹','刷白','房屋征收','农网','动迁','专利','注册','灯光','线虫病','干粉灭火','注射','文旅','创意','动物交易','养猪场','饮用水','灯饰','农作物','整体迁建','救灾物资','视频终端','铸铁管网','资产评估','血液','接待','人脸识别','创新','征集','饲料','抓拍','食品','食用菌','教学器材','绿肥种子','查询','温室','大棚','花卉租摆','喷绘','教学培训','接水槽','医学仪器','灭火','固封','配送','灵位','萃取','排风','全媒体','工作服','防洪','流域生态','农业','经营','历史文化','档案升级','防火','农产品','检疫','编纂','军事化','包机','天气','访谈','室内装具','安全升级','生活','能源','视频','包装','疗休','检验仪','计划生育','报警','职工','人工造林','健身','灌溉','玻璃','照相','殡葬','商品质量','教学','桌','气体','畜牧','医学','标识牌制作','药品','中医药','价值评估','形象设计','乐器','休养','备用电源','防灾','志愿','循环机','碳浓度','用车配备','测序','铺设安装','潜水','屠宰','园林科学','润滑油','扫把','挡粮门','纪念品','活动演出','立法','审计调查','云平台','群众工作','果蔬','心理援助','河流','艺术品','除工除险','查询系统','材料购置','无线直放站','沼渣','橡胶垫板','卫生发包','水生生态','账户开户','专用材料','育苗','物料','对讲机','纳污','承销商','谱光源','官网升级','实训系统','泥石流','发展战略','社会保护','警用装备','不锈钢门','就业','水管','饲料生产','聚乙烯','卷帘门','架子位','诱捕器','玉米种子','纸质期刊','套装','宣传品','雷达监测','数据补采集','档案密集架','预算绩效','维护治理','水表','电子化','蓄水安全','玩具','船牌制作','产能','除草养护','采访活动','公益金','车间取样','门匾','墓材','绝缘器','粉刷','预报','数据加工','高压','船码头资金银行','射频单元','配套设施','管理督查','物资购置','绩效','走班','收集容器','资产','天然气','燃气改造','WIFI','诊疗','综合整治','数据审计','数据共享','大米','猪油','面粉','杂件','低能耗','植入治疗','药具','客户端','热源','专用汽车','信用融资','商城','风险管控','经济试点','诊断仪','除四害','社会工作','粮食生产','公益电影','信用信息','胶印机','茶苗','生物','取暖煤','氟化锆','射线','热发电','果菜','钢架','燃煤','沙盘','监管系统','钢琴','大提琴','动能转换','传送线','综合信息','外电接入','未成年人','林业资源','办案系统','防爆膜','橡胶套筒','灾害','主页','训练装备','推介活动','治理体系','多普勒','切片机','投诉处理','汽车更新','治疗','情境实战','颁奖典礼','VI','设计及制作','出入境','WEB应用','社会车辆','噪声分析仪','沥青改性剂','有机物','航拍建模','交易团','花展','网站','环卫','废水','综合处理','农机','清洁','机械开沟','游览船','热凝器','保障车','清运','管道疏通','成本','核算','密集架','OA','促销','执法','记录仪','花境','结算审计','隐患','排查','输出','电脑配件','学术交流','矿浆','销售代理','专栏','机动车','切断阀','网签备案','预售资金','印刷业务','OA协同办公系统','设备维修','渣土车','防火玻璃','玻璃栏板','3D手术转播','示教系统','实训','双连杆','静压框架锯','车辆检验','生命探测仪','公交','生物质','热电联产','开垦','小苗','金融','医院机器','体育设备','驾考','技术设备','旅游推广','机房更新','行车记录仪','煤油气','除雪机','水闸除险','警报器','网警装备','电力配套','装载机','超限检测','租房','公厕','救灾棉被','公墓','节水灌溉','空分空压','增压机','果树','书吧展示','配发文具','退渔','退田','还湖','办证设备','节能锅炉','加药装置','营养改善','音箱','安保管理','水质保护','移动执法','软硬件维保','登记平台','房产交易','信息协同','共享','烟叶','空气源','热泵','热水','指挥系统','专户','开户银行','治安车','秸秆','辐照仪','花海','医疗','圆顶巨蛋屋','文化活动','点钞机','狂犬病','灭活','模拟人','城管','闪存','阵列配件','除磷剂','组展','防汛抗旱','气候','农副产品','校用','珍贵树','展示馆模型维护','u盘','拖拉机','针器','工具','强光','手电筒','路径','慰问品','标识牌','进口仪器','沼气','农用','校园安保','银行WiFi系统','房地产评估','四害','消杀','固渣','苗木','火警','联网监管','地磅','救护车','硅藻土','酒店杂件','船舶','招聘会','吡喹酮','电子资源','家具','图书采购','虚拟化','课程','耗材','保险服务','宽带','网络','服务器','学习','劳务派遣','法律服务','租赁服务','医疗设备','热线','话务','信息管理','教材','动物防疫','短信','HRP','LED','顾问服务','养殖','肉','图书','有机肥采购','清洁服务','飞防服务','飞机防治','洒水车','试剂','礼盒','蓝皮书','清洗','林木出让','广告','拍摄','网络设备','床','衣柜','体检','数据服务','酶','药品经营','信息安全','文体设备','医疗器械','生物防治','服装道具','服装','保管','水产种苗','牛养殖','丧葬','VR系统','司法鉴定','物业管理','气代煤','食品安全','桌椅','消耗材料','打印设备','监测委托','台式电脑','害虫','养老','招租','创业','实习实训','统计分析','决策','洗涤','车采购','防护服务','保险业务','餐饮','运行维护','音乐','美术','鱼苗','安全劝导','培训项目','审计项目','音响','气象','保洁','食堂经营','药剂','培训机构','轿车','车处置','客车','车辆转让','租赁','产权交易','废旧物资','餐饮服务','气体监测','货车','越野车','车位','承租权','房招租','土地招拍','租赁权','使用权','公开转让','拍卖标的','建设用地','债权','转让交易','竞租','转让标的','处置','用品','专题片','教学软件','软件开发','印刷服务','土地经营权','杀虫','定位','关爱老人','办公家具','许可证','技能培训','个人资产','审计服务','印制','食堂管理','病理','专用设备','软件项目','食堂外包服务','实训实习','音视频','服务器采购','实验室仪器设备','宣传片','体育器材','车辆采购','生物监测','药品生产','文化服务','焚烧处置','研学','增雨','防雹','次氯酸钠','食宿外包','车辆维保','会计机构','物业服务','养老立法','快递寄送','营养早餐','机动车类','面包车','审计报告','水质调查','出版招标','白蚁防治','超声诊断仪','流动','分析仪','旅游合作','杂志','护理员','派遣','吹塑','托盘','地图数据','旅游发展','资格证书','粪便清运','垃圾清理','公款','存放','移动DR','X射线','头颅','设计印刷','大气','水自动监测','合作银行','化肥采购','杀虫剂','杀菌剂','除草剂','农药化肥','船舶修理','dSPACE','锦标赛','网站推广','印刷业','经营许可','派遣机构','车服务','车辆检测','旅游宣传','舞台','幕布','自理能力','用车','集中支付','公务','机票','车辆拍卖','转播车','银行项目','鼓风机','分散式','采暖','操作须知','以醇代煤','甲醇','家用','自行车赛','冬季','用煤','变电所','增容','大气污染','程控','降温仪','渔业','资源保护','政务服务','舞美','创作','卫星','遥感影像','立体像','行业警示','防寒','塑钢','高清','车牌','识别','铺膜','播种机','优秀论文','疫病','品牌','闹新春','惠民','钾类','抑尘剂','民俗','文化旅游','鱼跃','标识标牌','综合通信','垃圾收运','辅助设备','有机','废物','春节','灯杆','挂件','机扫','业务能力','服务终端','服务设备','区域性','中央厨房','融雪盐','交通警察','支队','以电代煤','散煤','电气设备','电梯采购','救灾应急','交通信号灯','活动策划','会议中心','石灰','石粉','锅炉房','冷冻','电镜','飞机租机','室内二次设计','扬尘','车载走航','尾气','精细化','PCL系统','壁挂炉','健康教育','颗粒','救援车','亮化设备','课堂','录播','光影秀','照明设备','中外文','血管','造影机','超导','核磁共振','调频','广播','发射机','乡村清洁工程设备','直线加速器','彩色多普勒超声波','螺旋CT','脱硝剂、液碱产品','陈列设施采购','螺杆式','一体风冷','渗滤液','执法艇','直购电','理化生','实验室设备','支付系统','广播电视','演播','作业车','饭堂','食品配送','殡仪馆','喷泉','液晶','竞拍','高教','助残','器具','书博','文物','机房空调','粉盒','休克','超声波仪器','周末','大舞台','协调机制','公共自行车','畅游','路牌','驾驶','资格培训','英华汽车','商务车','环卫装备','其他车辆','高空作业车','分体式','器械','自控','载货汽车','有机肥','幼儿玩具','烟系统','分类','电视设备','实训台','媒体','营销','数字电视','机顶盒','食堂改装','维修','海鲜','服务平台','特种汽车','尸体','解剖室','空气调节','安防监控','通信设备','垃圾压缩','箱体','电子政务','外网','防暴','训练设施','清运设备','自动监测站','荧光','免疫','自动操作','饮用','洗浴','环卫设备','种源','电影','北斗','GPS','浮雕','雕像','空气能','采血车','道路清扫','扫路机','登船梯','分析中心','化学','堆积门','营销活动','承办资格','汽车部件','气质联用仪','投影机','微波消解仪','查验设备','语音','广播系统','排烟','通风','等离子','双极','内窥镜','椎间','孔镜','微创','相机','超声系统','频振式','杀虫灯','登高','扩音系统','碎石机','限载','标志牌','称重仪','视频教学','集水槽','种苗','鲜花','摆放','电视塔','播出','指挥调度','气动钻','病虫','胆道镜','实践中心','轻微','违法行为','排爆','自控式','余热','果皮箱','配方肥','洒水','喷药','苏醒','放映设备','专用车','科目二','考试','虫害','行驶方向','箭头','防治药','能量控制','监护站','显微镜','三轮车','呼吸机','单道','移液器','水平式','垃圾压缩机','X线','C臂机','纯水仪','路灯维修','无线','技术装备','银杏','微生物','研究设备','放射','生猪','精液','业务装备','液压式','卫生室','指示牌','安全设备','辨证','肺功能仪','肌电图仪','春节慰问品','展厅','运输物流','自动售检票','胚胎','操作仪','油漆','速测','办公自动化','民族乐器','药房','警务','红绿灯','密封','人孔门','光学','元器件','标示标牌','电动','三轮','垃圾收集','救灾','帐篷','康复','汽车询价','供氧','呼叫','小旅馆','身份信息','综合布线','雷达','射频','臭氧','核桃','特警','爱心家园','终端服务机','直饮水','民乐','灭蝇','玻璃体','切割仪','支气管','疫情','五类线','卫星站','自卸式','装置硫','MDEA胺液','冷轧','碱液','刷洗','槽刷','应急救援','胃镜','光刻机','数字录放机','宣传册','电感','耦合','等离子体','天籁车','流速','剖面仪','电瓶车','小孩','医用X线机','遗体流转','医养','河道清淤','冠军赛','运输作业','煤采购','防控','应急物资','配件检测','数字资源','SCADA系统','应急监测设备','物种资源','远程教育','学校仪器','食品药品','管理体制','营运服务','食堂采购','锅炉采购','物业采购','症状','感染者','核酸','肺炎','健康委','文明城市','创城','危化品','&amp','1的','营业厅','巡视反馈','巡查反馈','省委关于','服务保障','火星','李克强','习近平','王岐山','栗战书','王沪宁','汪洋','赵乐际','饮水设备','杀毒软件','诗词','朗诵','舞蹈','歌唱','演唱','煤炭','信息化设备','廉政','反腐','运动会','国务院','政治局','中共中央','人大常委','常委会','全国政协','人大代表','总书记','总理','国家主席','外交','国务常委','十九大','学习强国','社论','人民日报','求是','中组部','中纪委','国家监委','光明日报','解放军报','解放军','中央军委','中宣部','全国人大','中全会','巡视','党中央','党校','中国梦','习主席','法院','检察院','一国两制','基本法','民族区域自治','拥护','祖国统一','台湾','反分裂','恐怖','宗教','核心价值观','社会主义','共产','资本主义','封建','帝国','殖民','侵略','霸权','主权','殡仪','火葬','医生','护士','老师','学生','零售','日用品','奢侈品','入学','贫困家庭','河南日报','郑州日报','河北日报','湖北日报','张家口日报','新华日报','政协','北约','军队','国防','投票','大选','选举','国务卿','首相','总统','爱国','自由','民主','指导意见','区块链','数字广西','数字中国','继承','不动产证','思想','道德','直播','带货','扶贫','精神文明','党组','扩大','体质','民航局','确诊','病例','药店','药物','客运市场','私募基金','心理','纪检监察','脱贫','私人','曲艺','攻略','邮政局','快递员','外卖','读书会','高考','密码','反诈','公安机关','实战','病患','商用车','暖冬','公报','全会','决议','民族团结','党外人士','权威发布','全体会议','巡察','中共市委','中共省委','证券','党课','证券市场','中央+会议','经济体','经济体量','中央+督察','中央+巡视','中央+经济','务虚会','团体赛','比武','不忘初心','牢记使命','跟党走','感党恩','听党话','厉行节俭','餐饮浪费','光盘行动','厉行节约','反对浪费','特殊使命','感谢信','寒潮','录制','贫困户','慰问+老党员','慰问+退役军人','慰问+老人','慰问+家庭','慰问+青少年','春运','供暖监控','监控+台账','监控+评选活动','监控+医保','大运河监控','防火监控','监控+收费站','车辆动态监控','资金监控','煤矿+监控','资金动态监控','公交车智能监控','卫星+动态监控','太凤监控','监控+疫情','监控+考试','监控+网上巡查','公司监控','油烟在线监控','监控+分拣','监控+培训','监控+谈心','考核指标监控','监控+业务','监控+军事训练','监控+竞赛','监控+河湖','监控+面试','监控+调研','监控+油烟','监控+行车','监控+禁渔','监控+排污','监控用水','监控结算','企业在线监控','监测+周报','地价动态','疾病+监测','监测+业务','监测+价格','智慧监测','监测+揭牌','监测+培训','人口监测','监测+粳稻','监测+化妆品','监测+妇女','监测+儿童','监测+化工','监测+油烟','监测+生活必需品','监测+网络安全','监测+体温','监测+教育','贫困监测','监测+返贫','监测+粮食','监测+粮油','监测+食品','监测+PM2.5','监测+流感','监测+信用','监测+疾控','经济监测','监测+汽车','卫生监测','人员监测','监测+货运','监测+游客','地震监测','融资监测','监测+粉尘','监测+医院','监测+融资','监测+食用林','资金监测','监测+防汛','监测+国情','监测+草原','监测+地下水','监测+地价','监测+农畜','监测+流水账','监测+低保','监测+特困','药残监测','监测+扰民','农房监测','监测+景区','助学','贺词','献词','新征程','防疫','抗疫','疫','猪','刷脸','丰收','病毒','流感','关爱','迎新春','佳节','情怀','回家','过冬','关怀','唱响','唱','二维码','爱情','超市','感染','疾控','新春','贺岁','晚会','你好','扫黄','过好年','老年人','感恩','打烊','迎新年','扫黑','卫视','送祝福','牛年','过年','灯谜','元宵','搜救','汽车消费','旅途','成长','一氧化碳','节水','【以案释法】','作画','放假','清明节','劳动节','党史','绿色出行','缅怀','祭扫','先烈','扫墓','短视频','文化节','马拉松','考古','时装周','剧目','捐款','用火','祭祀','返乡']
    #   for x in ci:
    #       if '+' in x:
    #           if x.split("+")[0] in title and x.split("+")[1] in title:
    #               return x
    #       elif x in title:
    #           return x
    #   return ''
    # except:
    return ''

#自动获取 省份id ,城市id 并赋值给items
def diqu(diqu,items):
    #省份id ,城市id
    shi={'北京市':'1&2','天津市':'19&20','石家庄市':'37&38','辛集市':'37&38','晋州市':'37&38','新乐市':'37&38','唐山市':'37&61','遵化市':'37&61','迁安市':'37&61','秦皇岛市':'37&76','邯郸市':'37&84','武安市':'37&84','邢台市':'37&104','南宫市':'37&104','沙河市':'37&104','保定市':'37&124','新市区':'37&124','北市区':'37&124','南市区':'37&124','涿州市':'37&124','定州市':'37&124','安国市':'37&124','高碑店市':'37&124','张家口市':'37&150','承德市':'37&168','沧州市':'37&180','泊头市':'37&180','任丘市':'37&180','黄骅市':'37&180','河间市':'37&180','廊坊市':'37&197','霸州市':'37&197','三河市':'37&197','衡水市':'37&208','冀州市':'37&208','深州市':'37&208','太原市':'220&221','古交市':'220&221','大同市':'220&232','阳泉市':'220&244','长治市':'220&250','潞城市':'220&250','晋城市':'220&264','高平市':'220&264','朔州市':'220&271','晋中市':'220&278','介休市':'220&278','运城市':'220&290','永济市':'220&290','河津市':'220&290','忻州市':'220&304','原平市':'220&304','临汾市':'220&319','侯马市':'220&319','霍州市':'220&319','吕梁市':'220&337','孝义市':'220&337','汾阳市':'220&337','呼和浩特市':'351&352','包头市':'351&362','乌海市':'351&372','赤峰市':'351&376','通辽市':'351&389','霍林郭勒市':'351&389','鄂尔多斯市':'351&398','呼伦贝尔市':'351&407','满洲里市':'351&407','牙克石市':'351&407','扎兰屯市':'351&407','额尔古纳市':'351&407','根河市':'351&407','巴彦淖尔市':'351&422','乌兰察布市':'351&430','丰镇市':'351&430','乌兰浩特市':'351&442','阿尔山市':'351&442','二连浩特市':'351&449','锡林浩特市':'351&449','沈阳市':'466&467','新民市':'466&467','大连市':'466&481','瓦房店市':'466&481','普兰店市':'466&481','庄河市':'466&481','鞍山市':'466&492','海城市':'466&492','抚顺市':'466&500','本溪市':'466&508','丹东市':'466&515','东港市':'466&515','凤城市':'466&515','锦州市':'466&522','凌海市':'466&522','北镇市':'466&522','营口市':'466&530','西市区':'466&530','盖州市':'466&530','大石桥市':'466&530','阜新市':'466&537','辽阳市':'466&545','灯塔市':'466&545','盘锦市':'466&553','铁岭市':'466&558','调兵山市':'466&558','开原市':'466&558','朝阳市':'466&566','北票市':'466&566','凌源市':'466&566','葫芦岛市':'466&574','兴城市':'466&574','长春市':'585&586','榆树市':'585&586','德惠市':'585&586','吉林市':'585&597','蛟河市':'585&597','桦甸市':'585&597','舒兰市':'585&597','磐石市':'585&597','四平市':'585&607','公主岭市':'585&607','双辽市':'585&607','辽源市':'585&614','通化市':'585&619','梅河口市':'585&619','集安市':'585&619','白山市':'585&627','临江市':'585&627','松原市':'585&634','扶余市':'585&634','白城市':'585&640','洮南市':'585&640','大安市':'585&640','延吉市':'585&646','图们市':'585&646','敦化市':'585&646','珲春市':'585&646','龙井市':'585&646','和龙市':'585&646','哈尔滨市':'655&656','尚志市':'655&656','五常市':'655&656','齐齐哈尔市':'655&675','讷河市':'655&675','鸡西市':'655&692','虎林市':'655&692','密山市':'655&692','鹤岗市':'655&702','双鸭山市':'655&711','大庆市':'655&720','伊春市':'655&730','铁力市':'655&730','佳木斯市':'655&748','同江市':'655&748','富锦市':'655&748','七台河市':'655&759','牡丹江市':'655&764','绥芬河市':'655&764','海林市':'655&764','宁安市':'655&764','穆棱市':'655&764','黑河市':'655&775','北安市':'655&775','五大连池市':'655&775','绥化市':'655&782','安达市':'655&782','肇东市':'655&782','海伦市':'655&782','上海市':'801&802','南京市':'820&821','无锡市':'820&833','江阴市':'820&833','宜兴市':'820&833','徐州市':'820&842','新沂市':'820&842','邳州市':'820&842','常州市':'820&853','溧阳市':'820&853','金坛市':'820&853','苏州市':'820&861','常熟市':'820&861','张家港市':'820&861','昆山市':'820&861','太仓市':'820&861','南通市':'820&871','启东市':'820&871','如皋市':'820&871','海门市':'820&871','连云港市':'820&880','淮安市':'820&887','盐城市':'820&896','东台市':'820&896','大丰市':'820&896','扬州市':'820&906','仪征市':'820&906','高邮市':'820&906','镇江市':'820&913','丹阳市':'820&913','扬中市':'820&913','句容市':'820&913','泰州市':'820&920','兴化市':'820&920','靖江市':'820&920','泰兴市':'820&920','宿迁市':'820&927','杭州市':'933&934','建德市':'933&934','临安市':'933&934','宁波市':'933&948','余姚市':'933&948','慈溪市':'933&948','奉化市':'933&948','温州市':'933&960','瑞安市':'933&960','乐清市':'933&960','嘉兴市':'933&972','海宁市':'933&972','平湖市':'933&972','桐乡市':'933&972','湖州市':'933&980','绍兴市':'933&986','诸暨市':'933&986','嵊州市':'933&986','金华市':'933&993','兰溪市':'933&993','义乌市':'933&993','东阳市':'933&993','永康市':'933&993','衢州市':'933&1003','江山市':'933&1003','舟山市':'933&1010','台州市':'933&1015','温岭市':'933&1015','临海市':'933&1015','丽水市':'933&1025','龙泉市':'933&1025','合肥市':'1046&1047','巢湖市':'1046&1047','芜湖市':'1046&1057','蚌埠市':'1046&1066','淮南市':'1046&1074','马鞍山市':'1046&1081','淮北市':'1046&1088','铜陵市':'1046&1093','安庆市':'1046&1098','桐城市':'1046&1098','黄山市':'1046&1110','滁州市':'1046&1118','天长市':'1046&1118','明光市':'1046&1118','阜阳市':'1046&1127','界首市':'1046&1127','宿州市':'1046&1136','六安市':'1046&1142','亳州市':'1046&1150','池州市':'1046&1155','宣城市':'1046&1160','宁国市':'1046&1160','福州市':'1168&1169','福清市':'1168&1169','长乐市':'1168&1169','厦门市':'1168&1183','莆田市':'1168&1190','三明市':'1168&1196','永安市':'1168&1196','泉州市':'1168&1209','石狮市':'1168&1209','晋江市':'1168&1209','南安市':'1168&1209','漳州市':'1168&1222','龙海市':'1168&1222','南平市':'1168&1234','邵武市':'1168&1234','武夷山市':'1168&1234','建瓯市':'1168&1234','龙岩市':'1168&1245','漳平市':'1168&1245','宁德市':'1168&1253','福安市':'1168&1253','福鼎市':'1168&1253','南昌市':'1263&1264','景德镇市':'1263&1274','乐平市':'1263&1274','萍乡市':'1263&1279','九江市':'1263&1285','瑞昌市':'1263&1285','共青城市':'1263&1285','新余市':'1263&1299','鹰潭市':'1263&1302','贵溪市':'1263&1302','赣州市':'1263&1306','瑞金市':'1263&1306','吉安市':'1263&1325','井冈山市':'1263&1325','宜春市':'1263&1339','丰城市':'1263&1339','樟树市':'1263&1339','高安市':'1263&1339','抚州市':'1263&1350','上饶市':'1263&1362','德兴市':'1263&1362','济南市':'1375&1376','市中区':'1375&1376','章丘市':'1375&1376','青岛市':'1375&1387','市南区':'1375&1387','市北区':'1375&1387','胶州市':'1375&1387','即墨市':'1375&1387','平度市':'1375&1387','莱西市':'1375&1387','淄博市':'1375&1399','枣庄市':'1375&1408','市中区':'1375&1408','滕州市':'1375&1408','东营市':'1375&1415','烟台市':'1375&1421','龙口市':'1375&1421','莱阳市':'1375&1421','莱州市':'1375&1421','蓬莱市':'1375&1421','招远市':'1375&1421','栖霞市':'1375&1421','海阳市':'1375&1421','潍坊市':'1375&1434','青州市':'1375&1434','诸城市':'1375&1434','寿光市':'1375&1434','安丘市':'1375&1434','高密市':'1375&1434','昌邑市':'1375&1434','济宁市':'1375&1447','曲阜市':'1375&1447','邹城市':'1375&1447','泰安市':'1375&1459','新泰市':'1375&1459','肥城市':'1375&1459','威海市':'1375&1466','荣成市':'1375&1466','乳山市':'1375&1466','日照市':'1375&1471','莱芜市':'1375&1476','临沂市':'1375&1479','德州市':'1375&1492','乐陵市':'1375&1492','禹城市':'1375&1492','聊城市':'1375&1504','临清市':'1375&1504','滨州市':'1375&1513','菏泽市':'1375&1522','郑州市':'1532&1533','巩义市':'1532&1533','荥阳市':'1532&1533','新密市':'1532&1533','新郑市':'1532&1533','登封市':'1532&1533','开封市':'1532&1546','洛阳市':'1532&1556','偃师市':'1532&1556','平顶山市':'1532&1572','舞钢市':'1532&1572','汝州市':'1532&1572','安阳市':'1532&1583','林州市':'1532&1583','鹤壁市':'1532&1593','新乡市':'1532&1599','卫辉市':'1532&1599','辉县市':'1532&1599','焦作市':'1532&1612','沁阳市':'1532&1612','孟州市':'1532&1612','濮阳市':'1532&1623','许昌市':'1532&1630','禹州市':'1532&1630','长葛市':'1532&1630','漯河市':'1532&1637','三门峡市':'1532&1643','义马市':'1532&1643','灵宝市':'1532&1643','南阳市':'1532&1650','邓州市':'1532&1650','商丘市':'1532&1664','永城市':'1532&1664','信阳市':'1532&1674','周口市':'1532&1685','项城市':'1532&1685','驻马店市':'1532&1696','济源市':'1532&1707','武汉市':'1532&1707','黄石市':'1709&1724','大冶市':'1709&1724','十堰市':'1709&1731','丹江口市':'1709&1731','宜昌市':'1709&1740','宜都市':'1709&1740','当阳市':'1709&1740','枝江市':'1709&1740','襄阳市':'1709&1754','老河口市':'1709&1754','枣阳市':'1709&1754','宜城市':'1709&1754','鄂州市':'1709&1764','荆门市':'1709&1768','钟祥市':'1709&1768','孝感市':'1709&1774','应城市':'1709&1774','安陆市':'1709&1774','汉川市':'1709&1774','荆州市':'1709&1782','沙市区':'1709&1782','石首市':'1709&1782','洪湖市':'1709&1782','松滋市':'1709&1782','黄冈市':'1709&1791','麻城市':'1709&1791','武穴市':'1709&1791','咸宁市':'1709&1802','赤壁市':'1709&1802','随州市':'1709&1809','广水市':'1709&1809','恩施市':'1709&1813','利川市':'1709&1813','仙桃市':'1709&1822','潜江市':'1709&1822','天门市':'1709&1822','长沙市':'1827&1828','浏阳市':'1827&1828','株洲市':'1827&1838','醴陵市':'1827&1838','湘潭市':'1827&1848','湘乡市':'1827&1848','韶山市':'1827&1848','衡阳市':'1827&1854','耒阳市':'1827&1854','常宁市':'1827&1854','邵阳市':'1827&1867','武冈市':'1827&1867','岳阳市':'1827&1880','汨罗市':'1827&1880','临湘市':'1827&1880','常德市':'1827&1890','津市市':'1827&1890','张家界市':'1827&1900','益阳市':'1827&1905','沅江市':'1827&1905','郴州市':'1827&1912','资兴市':'1827&1912','永州市':'1827&1924','怀化市':'1827&1936','洪江市':'1827&1936','娄底市':'1827&1949','冷水江市':'1827&1949','涟源市':'1827&1949','吉首市':'1827&1955','广州市':'1964&1965','韶关市':'1964&1977','乐昌市':'1964&1977','南雄市':'1964&1977','深圳市':'1964&1988','珠海市':'1964&1999','汕头市':'1964&2003','佛山市':'1964&2011','江门市':'1964&2017','台山市':'1964&2017','开平市':'1964&2017','鹤山市':'1964&2017','恩平市':'1964&2017','湛江市':'1964&2025','廉江市':'1964&2025','雷州市':'1964&2025','吴川市':'1964&2025','茂名市':'1964&2035','高州市':'1964&2035','化州市':'1964&2035','信宜市':'1964&2035','肇庆市':'1964&2041','高要市':'1964&2041','四会市':'1964&2041','惠州市':'1964&2050','梅州市':'1964&2056','兴宁市':'1964&2056','汕尾市':'1964&2065','陆丰市':'1964&2065','河源市':'1964&2070','阳江市':'1964&2077','阳春市':'1964&2077','清远市':'1964&2082','英德市':'1964&2082','连州市':'1964&2082','东莞市':'1964&2091','中山市':'1964&2123','潮州市':'1964&2146','揭阳市':'1964&2150','普宁市':'1964&2150','云浮市':'1964&2156','罗定市':'1964&2156','南宁市':'2162&2163','柳州市':'2162&2177','桂林市':'2162&2189','梧州市':'2162&2207','岑溪市':'2162&2207','北海市':'2162&2215','防城港市':'2162&2220','东兴市':'2162&2220','钦州市':'2162&2225','贵港市':'2162&2230','桂平市':'2162&2230','玉林市':'2162&2236','北流市':'2162&2236','百色市':'2162&2245','贺州市':'2162&2258','河池市':'2162&2264','宜州市':'2162&2264','来宾市':'2162&2276','合山市':'2162&2276','崇左市':'2162&2283','凭祥市':'2162&2283','海口市':'2291&2292','三亚市':'2291&2297','三沙市':'2291&2302','五指山市':'2291&2306','琼海市':'2291&2306','儋州市':'2291&2306','文昌市':'2291&2306','万宁市':'2291&2306','东方市':'2291&2306','重庆市':'2323&2324','成都市':'2367&2368','都江堰市':'2367&2368','彭州市':'2367&2368','邛崃市':'2367&2368','崇州市':'2367&2368','自贡市':'2367&2388','攀枝花市':'2367&2395','泸州市':'2367&2401','德阳市':'2367&2409','广汉市':'2367&2409','什邡市':'2367&2409','绵竹市':'2367&2409','绵阳市':'2367&2416','江油市':'2367&2416','广元市':'2367&2426','遂宁市':'2367&2434','内江市':'2367&2440','市中区':'2367&2440','乐山市':'2367&2446','市中区':'2367&2446','峨眉山市':'2367&2446','南充市':'2367&2458','阆中市':'2367&2458','眉山市':'2367&2468','宜宾市':'2367&2475','广安市':'2367&2486','华蓥市':'2367&2486','达州市':'2367&2493','万源市':'2367&2493','雅安市':'2367&2501','巴中市':'2367&2510','资阳市':'2367&2516','简阳市':'2367&2516','西昌市':'2367&2554','贵阳市':'2572&2573','清镇市':'2572&2573','六盘水市':'2572&2584','遵义市':'2572&2589','赤水市':'2572&2589','仁怀市':'2572&2589','安顺市':'2572&2604','毕节市':'2572&2611','铜仁市':'2572&2620','兴义市':'2572&2631','凯里市':'2572&2640','都匀市':'2572&2657','福泉市':'2572&2657','昆明市':'2670&2671','安宁市':'2670&2671','曲靖市':'2670&2686','宣威市':'2670&2686','玉溪市':'2670&2696','保山市':'2670&2706','昭通市':'2670&2712','丽江市':'2670&2724','普洱市':'2670&2730','临沧市':'2670&2741','楚雄市':'2670&2750','个旧市':'2670&2761','开远市':'2670&2761','蒙自市':'2670&2761','弥勒市':'2670&2761','文山市':'2670&2775','景洪市':'2670&2784','大理市':'2670&2788','瑞丽市':'2670&2801','芒市':'2670&2801','香格里拉市':'2670&2812','拉萨市':'2816&2817','日喀则市':'2816&2826','昌都市':'2816&2845','西安市':'2898&2899','铜川市':'2898&2913','宝鸡市':'2898&2918','咸阳市':'2898&2931','兴平市':'2898&2931','渭南市':'2898&2946','韩城市':'2898&2946','华阴市':'2898&2946','延安市':'2898&2958','汉中市':'2898&2972','榆林市':'2898&2984','安康市':'2898&2997','商洛市':'2898&3008','兰州市':'3022&3023','嘉峪关市':'3022&3032','金昌市':'3022&3036','白银市':'3022&3039','天水市':'3022&3045','武威市':'3022&3053','张掖市':'3022&3058','平凉市':'3022&3065','酒泉市':'3022&3073','玉门市':'3022&3073','敦煌市':'3022&3073','庆阳市':'3022&3081','定西市':'3022&3090','陇南市':'3022&3098','临夏市':'3022&3108','合作市':'3022&3117','西宁市':'3126&3127','海东市':'3126&3135','玉树市':'3126&3165','格尔木市':'3126&3172','德令哈市':'3126&3172','银川市':'3178&3179','灵武市':'3178&3179','石嘴山市':'3178&3186','吴忠市':'3178&3190','青铜峡市':'3178&3190','固原市':'3178&3196','中卫市':'3178&3202','乌鲁木齐市':'3206&3207','新市区':'3206&3207','克拉玛依市':'3206&3216','吐鲁番市':'3206&3221','哈密市':'3206&3225','昌吉市':'3206&3229','阜康市':'3206&3229','博乐市':'3206&3237','阿拉山口市':'3206&3237','库尔勒市':'3206&3242','阿克苏市':'3206&3252','阿图什市':'3206&3262','喀什市':'3206&3267','和田市':'3206&3280','伊宁市':'3206&3289','奎屯市':'3206&3289','霍尔果斯市':'3206&3289','塔城市':'3206&3301','乌苏市':'3206&3301','阿勒泰市':'3206&3309','石河子市':'3206&3317','阿拉尔市':'3206&3317','图木舒克市':'3206&3317','五家渠市':'3206&3317','北屯市':'3206&3317','铁门关市':'3206&3317','双河市':'3206&3317','台北市':'3325&3326','高雄市':'3325&3339','基隆市':'3325&3378','台中市':'3325&3386','台南市':'3325&3416','新市区':'3325&3416','新竹市':'3325&3454','嘉义市':'3325&3458','新北市':'3325&3461','宜兰市':'3325&3491','桃园市':'3325&3504','中坜市':'3325&3504','平镇市':'3325&3504','八德市':'3325&3504','杨梅市':'3325&3504','芦竹市':'3325&3504','竹北市':'3325&3518','苗栗市':'3325&3532','彰化市':'3325&3551','南投市':'3325&3578','斗六市':'3325&3592','太保市':'3325&3613','朴子市':'3325&3613','屏东市':'3325&3632','台东市':'3325&3666','花莲市':'3325&3683','马公市':'3325&3697'}
    sheng={'澳门特别行政区':'3738&0','香港特别行政区':'3716&0','台湾':'3325&0','新疆维吾尔自治区':'3206&0','宁夏回族自治区':'3178&0','青海省':'3126&0','甘肃省':'3022&0','陕西省':'2898&0','西藏自治区':'2816&0','云南省':'2670&0','贵州省':'2572&0','四川省':'2367&0','重庆':'2323&0','海南省':'2291&0','广西壮族自治区':'2162&0','广东省':'1964&0','湖南省':'1827&0','湖北省':'1709&0','河南省':'1532&0','山东省':'1375&0','江西省':'1263&0','福建省':'1168&0','安徽省':'1046&0','浙江省':'933&0','江苏省':'820&0','上海':'801&0','黑龙江省':'655&0','吉林省':'585&0','辽宁省':'466&0','内蒙古自治区':'351&0','山西省':'220&0','河北省':'37&0','天津':'19&0','北京':'1&0'}
    try:
        for x in shi:
            if re.sub(r'市$','',x) in diqu:
                items['province']=shi[x].split("&")[0]
                items['city']=shi[x].split("&")[1]
                # print(x)
                return '成功获取',shi[x],diqu
        for x in sheng:
            if  re.sub(r'省$','',x) in diqu:
                # print(x)
                items['province']=sheng[x].split("&")[0]
                items['city']=sheng[x].split("&")[1]
                return '成功获取',sheng[x],diqu
        return '获取失败'
    except:
        return '错误'

class AesCrypt():
    def __init__(self, key, model, iv):
        self.model = {'ECB': AES.MODE_ECB, 'CBC': AES.MODE_CBC}[model]
        self.key = self.add_16 (key)
        self.iv = iv.encode ()
        if model == 'ECB':
            self.aes = AES.new (self.key, self.model)  # 创建aes对象
        elif model == 'CBC':
            self.aes = AES.new (self.key, self.model, self.iv)  # 创建aes对象

    def add_16(self,par):
        # python3字符串是unicode编码，需要 encode才可以转换成字节型数据
        par = par.encode('utf-8')
        while len(par) % 16 != 0:
            par += b'\x00'
        return par

    def pkcs7padding(self, text):
        """
        明文使用PKCS7填充
        """
        bs = 16
        length = len(text)
        bytes_length = len(text.encode('utf-8'))
        padding_size = length if (bytes_length == length) else bytes_length
        padding = bs - padding_size % bs
        padding_text = chr(padding) * padding
        self.coding = chr(padding)
        return text + padding_text

    def aesencrypt(self,text,qq='pkcs7padding'):
        if qq=='pkcs7padding':
            text=self.pkcs7padding(text)
        else:
            text = self.add_16(text)
        self.encrypt_text = self.aes.encrypt(text.encode('utf-8'))
        return base64.encodebytes(self.encrypt_text).decode().strip()


    # def aesdecrypt(self,text):
    #    text = base64.decodebytes(text.encode(self.encode_))
    #    self.decrypt_text = self.aes.decrypt(text)
    #    return self.decrypt_text.decode(self.encode_).strip('\0')

    def aesdecrypt(self, text):
        # CBC解密需要重新创建一个aes对象
        if self.model == AES.MODE_CBC:
            self.aes = AES.new(self.key, self.model, self.iv)
        text = base64.decodebytes(text.encode('utf-8'))
        self.decrypt_text = self.aes.decrypt(text).decode('utf8')
        pad = ["\x01", "\x02", "\x03", "\x04", "\x05", "\x06", "\x07", "\x08", "\x09", "\x10", "\x0a", "\x0b", "\x0c", "\x0d", "\x0e", "\x0f"]
        for x in pad:
            self.decrypt_text = self.decrypt_text.strip(x)
        return self.decrypt_text

#实时专用-数据库生成，爬过的不再爬取 url代表着 url和post发包 哨兵
class shi(object):
    def __init__(self):
        try:
            self.con = pymysql.connect(host="192.168.0.233",port=3306,user="shiuser",password="123456",db="shidb",charset="utf8mb4")
            self.cu = self.con.cursor()
            self.cu.execute("CREATE TABLE IF NOT EXISTS shi(source VARCHAR(255),url VARCHAR(255),date timestamp not null default current_timestamp on update current_timestamp,primary key(source,url),index url(`url`),index source(`source`));") #)
            self.cu.execute("delete from shi WHERE date<'"+(datetime.datetime.now()+datetime.timedelta(days=-1)).strftime("%Y-%m-%d")+"';")
            self.con.commit()
            self.mun=0
            # print('sql连接成功')
        except:
            print('sql报错')

    def shishi(self,source,url):
        try:
            shi=hashlib.md5(str(url).encode('UTF-8')).hexdigest()
            source=hashlib.md5(str(source).encode('UTF-8')).hexdigest()
            self.cu.execute("select * from shi WHERE source='"+str(source)+"' and url='"+str(shi)+"';")
            if self.cu.fetchone() and self.mun>0:
                # print('查得到')
                return False
            else:
                self.mun=1
                # print('查不到')
                return True
        except:
            return True

    def shishi1(self,source,url):
        try:
            shi=hashlib.md5(str(url).encode('UTF-8')).hexdigest()
            source=hashlib.md5(str(source).encode('UTF-8')).hexdigest()
            #写入
            # print(str(source),str(shi))
            self.cu.execute("replace into shi (source,url) VALUES ('"+str(source)+"','"+str(shi)+"')")
            self.con.commit()
        except:
            print('sql写入报错')

    def __del__(self):
        try:
            self.cu.close()
            self.con.close()
            # print('数据库已经关闭')
        except:
            pass


class ShishicesiItem(scrapy.Item):
    # define the fields for your item here like:
    # name = scrapy.Field()
    title=scrapy.Field()
    content=scrapy.Field()
    publishtime=scrapy.Field()
    original_url=scrapy.Field()
    notes = scrapy.Field()

    channel_id=scrapy.Field()
    source=scrapy.Field()
    city=scrapy.Field()
    province=scrapy.Field()
    
    areaname=scrapy.Field()

    # update=scrapy.Field()


class ArticleItem(scrapy.Item):
    # define the fields for your item here like:
    # name = scrapy.Field()
    title = scrapy.Field()
    content = scrapy.Field()
    publishtime = scrapy.Field()
    original_url = scrapy.Field()
    notes = scrapy.Field()
    
    channel_id = scrapy.Field()
    source = scrapy.Field()
    city = scrapy.Field()
    province = scrapy.Field()

    areaname = scrapy.Field()

    # update=scrapy.Field()

